Tekla Open API Reference for Tekla Structures 2025
Parallel.LineToPlane Method
Overload List
Name | Description
LineToPlane(Line, GeometricPlane)
 Returns true if the given line and plane are parallel.
LineToPlane(Line, GeometricPlane, Double)
 Returns true if the given line and plane are parallel within the given angular tolerance.
Top
See Also
Reference
Parallel Class
Tekla.Structures.Geometry3d Namespace